[Killed] BlockStatement
walmart-assessment-backend/src/health/health.controller.ts:7:44
 @Controller('health')
 export class HealthController {
   @Get()
-  public getHealthCheck(): HealthOutputDto {
-    return { message: 'walmart-assessment-backend is up and running' };
-  }
+  public getHealthCheck(): HealthOutputDto {}
 }
 
