[Killed] BlockStatement
walmart-assessment-backend/src/products/products.service.ts:10:85
 export class ProductsService {
   constructor(@InjectModel(Product.name) private readonly productModel: Model<ProductDocument>) {}
 
-  public async findProductsBySearchString(searchString: string): Promise<Product[]> {
-    const onlyNumbers = /^[0-9]+$/.test(searchString);
-    const moreThan3Chars = searchString.length >= 3;
-    if (!onlyNumbers && !moreThan3Chars) {
-      throw new HttpException('Search strings shorter than 3 characters must be valid product id', HttpStatus.BAD_REQUEST);
-    }
-    const $or = [];
-    if (onlyNumbers) {
-      $or.push({ id: parseInt(searchString) });
-    }
-    if (moreThan3Chars) {
-      const $regex = `.*${searchString}.*`;
-      $or.push({ description: { $regex } });
-      $or.push({ brand: { $regex } });
-    }
-    return this.productModel.find({ $or });
-  }
+  public async findProductsBySearchString(searchString: string): Promise<Product[]> {}
 }
 

[Killed] EqualityOperator
walmart-assessment-backend/src/products/products.service.ts:12:28
 
   public async findProductsBySearchString(searchString: string): Promise<Product[]> {
     const onlyNumbers = /^[0-9]+$/.test(searchString);
-    const moreThan3Chars = searchString.length >= 3;
+    const moreThan3Chars = searchString.length < 3;
     if (!onlyNumbers && !moreThan3Chars) {
       throw new HttpException('Search strings shorter than 3 characters must be valid product id', HttpStatus.BAD_REQUEST);

[Killed] ConditionalExpression
walmart-assessment-backend/src/products/products.service.ts:12:28
 
   public async findProductsBySearchString(searchString: string): Promise<Product[]> {
     const onlyNumbers = /^[0-9]+$/.test(searchString);
-    const moreThan3Chars = searchString.length >= 3;
+    const moreThan3Chars = true;
     if (!onlyNumbers && !moreThan3Chars) {
       throw new HttpException('Search strings shorter than 3 characters must be valid product id', HttpStatus.BAD_REQUEST);

[Killed] ConditionalExpression
walmart-assessment-backend/src/products/products.service.ts:13:9
   public async findProductsBySearchString(searchString: string): Promise<Product[]> {
     const onlyNumbers = /^[0-9]+$/.test(searchString);
     const moreThan3Chars = searchString.length >= 3;
-    if (!onlyNumbers && !moreThan3Chars) {
+    if (false) {
       throw new HttpException('Search strings shorter than 3 characters must be valid product id', HttpStatus.BAD_REQUEST);
     }

[Killed] BlockStatement
walmart-assessment-backend/src/products/products.service.ts:13:42
   public async findProductsBySearchString(searchString: string): Promise<Product[]> {
     const onlyNumbers = /^[0-9]+$/.test(searchString);
     const moreThan3Chars = searchString.length >= 3;
-    if (!onlyNumbers && !moreThan3Chars) {
-      throw new HttpException('Search strings shorter than 3 characters must be valid product id', HttpStatus.BAD_REQUEST);
-    }
+    if (!onlyNumbers && !moreThan3Chars) {}
     const $or = [];
     if (onlyNumbers) {

[Killed] ArrayDeclaration
walmart-assessment-backend/src/products/products.service.ts:16:17
     if (!onlyNumbers && !moreThan3Chars) {
       throw new HttpException('Search strings shorter than 3 characters must be valid product id', HttpStatus.BAD_REQUEST);
     }
-    const $or = [];
+    const $or = ["Stryker was here"];
     if (onlyNumbers) {
       $or.push({ id: parseInt(searchString) });

[Killed] ConditionalExpression
walmart-assessment-backend/src/products/products.service.ts:17:9
       throw new HttpException('Search strings shorter than 3 characters must be valid product id', HttpStatus.BAD_REQUEST);
     }
     const $or = [];
-    if (onlyNumbers) {
+    if (false) {
       $or.push({ id: parseInt(searchString) });
     }

[Killed] BlockStatement
walmart-assessment-backend/src/products/products.service.ts:17:22
       throw new HttpException('Search strings shorter than 3 characters must be valid product id', HttpStatus.BAD_REQUEST);
     }
     const $or = [];
-    if (onlyNumbers) {
-      $or.push({ id: parseInt(searchString) });
-    }
+    if (onlyNumbers) {}
     if (moreThan3Chars) {
       const $regex = `.*${searchString}.*`;

[Killed] ObjectLiteral
walmart-assessment-backend/src/products/products.service.ts:18:16
     }
     const $or = [];
     if (onlyNumbers) {
-      $or.push({ id: parseInt(searchString) });
+      $or.push({});
     }
     if (moreThan3Chars) {

[Killed] ConditionalExpression
walmart-assessment-backend/src/products/products.service.ts:20:9
     if (onlyNumbers) {
       $or.push({ id: parseInt(searchString) });
     }
-    if (moreThan3Chars) {
+    if (true) {
       const $regex = `.*${searchString}.*`;
       $or.push({ description: { $regex } });

[Killed] BlockStatement
walmart-assessment-backend/src/products/products.service.ts:20:25
     if (onlyNumbers) {
       $or.push({ id: parseInt(searchString) });
     }
-    if (moreThan3Chars) {
-      const $regex = `.*${searchString}.*`;
-      $or.push({ description: { $regex } });
-      $or.push({ brand: { $regex } });
-    }
+    if (moreThan3Chars) {}
     return this.productModel.find({ $or });
   }

[Killed] ObjectLiteral
walmart-assessment-backend/src/products/products.service.ts:22:16
     }
     if (moreThan3Chars) {
       const $regex = `.*${searchString}.*`;
-      $or.push({ description: { $regex } });
+      $or.push({});
       $or.push({ brand: { $regex } });
     }
