[Killed] BlockStatement
walmart-assessment-backend/src/products/products.controller.ts:12:95
 
   @Get('')
   @UsePipes(new ValidationPipe({ transform: true }))
-  public async findProducts(@Query() productsQuery: FindProductsInputDto): Promise<Product[]> {
-    const { searchString } = productsQuery;
-    return await this.productsSercvice.findProductsBySearchString(searchString);
-  }
+  public async findProducts(@Query() productsQuery: FindProductsInputDto): Promise<Product[]> {}
 }
 
